_protected/frontend/modules/controllers/TheController.php

    public function actionIndex()
    {

       $alias=Yii::$app->request->queryParams;
       $model=TblModels::find()->where(['alias'=> $alias])->one();
---
SELECT * FROM `tbl_models` WHERE `alias`='zzr1400-performance-sport-2017'