_protected/common/models/Videoslides.php

    public static function getAllVideos()
    {
        $videos = Videoslides::find()->asArray()->all();
---
SELECT * FROM `tbl_videoslides` WHERE `model_id`=986